% Очистити попередні результати виконання
clc

% Вхідні дані
A=[4,3,2,1; 5,6,7,-8; 7,1,5,3; 6,2,4,3]
B=[1,2; 3,5]
C=[1,2,5,7]'
D=[8,-1,-7,9]'

% 1. Визначити суму A+A0 і B+B0, де A0, B0 — зворотні матриці A і B відповідно.
A0=inv(A);
B0=inv(B);
ApA0 = A+A0
BpB0 = B+B0

% 2. Визначити добуток двох векторів CT * D і C * DT, де T — транспонування.
CTmD = C'*D
CmDT = C*D'

% 3. Власні числа матриці A і визначник матриці B.
VlasniChysla = eig(A)
Vyznachnyk = det(B)

% 4. Блочну матрицю F=[A,E;Z,B], де E — одинична матриця і Z — нульова матриця відповідної розмірності.
E=eye(4);
Z=zeros(2,6);
F=[A,E; Z,B]

% 5. Матрицю F1, вилучивши із F перші два рядки.
F1=F(3:size(F,1), :)

% 6. Матрицю F2, вилучивши з F останні два стовпчики.
F2=F(:, 1:size(F,2)-2)

% 7. Матрицю F3, вилучивши із F перші два рядки та три останні стовпчики.
F3=F(3:size(F,1), 1:size(F,2)-3)

% 8. Матрицю F4, замінивши у F перший рядок на нульовий
F4=[zeros(1, size(F,2)); F(2:size(F,1), :)]

% 9. Матрицю F5, замінивши у F перший стовпчик на нульовий.
F5=[zeros(size(F,1), 1), F(:, 2:size(F,2))]
