clc
clear

w = 5; h = 6;
lsize = w*h; % розмір літери 5x6 = 30
lnum = 4; % кількість літер
weights = zeros(lnum, lsize);

letter = -ones(1,lsize);
%  1  2  3  4  5
%  6  7  8  9 10
% 11 12 13 14 15
% 16 17 18 19 20
% 21 22 23 24 25
% 26 27 28 29 30
c = letter; c([10,2,3,4,6,11,16,21,27,28,29,25]) = 1;
t = letter; t([1,2,3,4,5,8,13,18,23,28]) = 1;
e = letter; e([1,2,3,4,5,6,11,12,13,14,15,16,21,26,27,28,29,30]) = 1;
u = letter; u([1,6,11,16,21,22,23,24,19,14,9,4,25,30]) = 1;
X = [c; t; e; u];

Y = -ones(lnum); Y([1,6,11,16]) = 1;

for i = 1:lnum % Для кожної літери
    x = X(i,:); % рядок пікселів
    y = Y(i,:); % рядок вихідних сигналів нейронів
    for j = 1:lnum % Для кожного нейрона
        % посилити (y = 1) або послабити (y = -1) всі вагові коефіцієнти
        weights(j,:) = weights(j,:) + x * y(j);
    end
end
disp(weights)

for i = 1:lnum
    x = X(i,:);
    disp( sign(x*weights') )
end
e2 = letter; e2([1,2,3,4,5,6,11,16,17,18,19,20,21,26,27,28,29,30]) = 1;
disp( sign(e2*weights') )
